const mbtiInfo = {
    //ENFJ
    ENFJ: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
            그렇지만 또 서로 같기 때문에 금방 질릴 수 있어요 조화롭게 성격을
            맞춰 나가고, 서로에 대한 흥미를 잃지 않는다면
            서로 더 오래갈 수 있을 거에요!`
    },
    ESFJ: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
            나와 다른 관점을 이해해주고 배울 점을 찾는다면
            오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '우리 사이는 딱 여기까지',
        소개멘트: `안전 거리 확보`,
        입력값멘트: `적절한 거리를 유지하기가 어려워요.
            가까우면 가까운 대로 실망하고, 그렇다고 멀어지면
            그간의 믿음이 흔들려요.
            상대는 그렇게 나쁜 사람이 아니라는 걸 늘 명심하세요.`
    },
    ISFJ: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '편하기 때문에 가능한',
        소개멘트: `절전모드`,
        입력값멘트: `알 수 없는 특우의 편안함이 있어요.
            너무 깊게 서로의 의도를 파악하려 하지만 않는다면
            오히려 오랫동안 좋은 사이로 지낼 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 보는 며느리군요.
            상대의 말과 행동이 신경이 쓰여요.
            상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
    },
    INFP: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
            그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
            그래도 대부분 좋은 친구 사이에요.`
    },
    ESFP: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
            상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
            그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
            상대는 바로 떠날 꺼에요.`
    },
    ENFP: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '미련없이 놓는 관계',
        소개멘트: `각자 마이웨이`,
        입력값멘트: `서로 자기가 더 잘났다고 생각하네요.
            상대를 이해하는 것도 피곤해요.
            그래도 서로에게 매력을 느낀다면 평화롭게
            관계를 지속할 수 있어요.`
    },
    ENTJ: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '끝임없는 충돌',
        소개멘트: `파이터클럽`,
        입력값멘트: `달라서 신기하고 호기심을 자극해요.
            친해지고 난 다음에는 서로 굽히지 않아서 부딪히게 됩니다.
            처음 느꼈던 신비로움을 잊지 마세요.`
    },

    INTJ: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '미친 속도로 올라갔다 내려갔다하는',
        소개멘트: `롤러코스터`,
        입력값멘트: `주기적으로 엄청나게 불타올랐다가 말도 안되게 식어요.
            너무나 잘 맞지만, 동시에 알 수 없는 삐걱거림이 있어요.
            불나방 같은 관계가 될 수 있습니다.`
    },
    ISTJ: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '당신이 꿈꾸던 소울메이트',
        소개멘트: `영혼의 단짝`,
        입력값멘트: `최상의 MBTI 궁합을 자랑하는 사이입니다.
            서로가 서로를 있는 그대로 아껴줘요.
            서로의 가치를 알아봐주는 상대를 만난다면
            오래갈 수 있을 거에요.`
    },
    ISTP: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '빨리 도망쳐!',
        소개멘트: `최악의 궁합`,
        입력값멘트: `놓아버리는 그 순간까지 계속해서 충돌합니다.
            마음을 비운 후에 오히려 편안해질 수 있어요.
            풀리지 않는 관계에 너무 집착하지 않으셔도 됩니다.`
    },
    INTP: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
            선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
            조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ESTP: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ENTP: {
        상대MBTI: ['ENFJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `나무에게서 도움을 받는 소년이군요.
            당신이 갖고 있지 않은 뭔가를 상대로부터 원하고
            상대도 건방진 나무긴 하지만, 얻을 게 없을 때
            바로 떠나버리는건 좀 슬프네요`
    },
    //ENTJ
    ENTJ: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
            그렇지만 또 서로 같기 때문에 금방 질릴 수 있어요 조화롭게 성격을
            맞춰 나가고, 서로에 대한 흥미를 잃지 않는다면
            서로 더 오래갈 수 있을 거에요!`
    },
    ESFJ: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '끊임없는 충돌',
        소개멘트: `파이터클럽`,
        입력값멘트: `달라서 신기하고 호기심을 자극해요.
        친해지고 난 다음에는 서로 굽히지 않아서 부딪히게 됩니다.
        처음 느꼈던 신비로움을 잊지 마세요.`
    },
    INFJ: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '미친 속도로 올라갔다 내려갔다 하는',
        소개멘트: `롤러코스터`,
        입력값멘트: `주기적으로 엄청나게 불타올랐다가 말도 안되게 식어요.
        너무나 잘 맞지만, 동시에 알 수 없는 삐걱거림이 있어요.
        불나방 같은 관계가 될 수 있습니다.`
    },
    ISFJ: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '당신이 꿈꾸던 소울메이트',
        소개멘트: `영혼의 단짝`,
        입력값멘트: `최상의 MBTI 궁합을 자랑하는 사이입니다.
        서로가 서로를 있는 그대로 아껴줘요.
        서로의 가치를 알아봐주는 상대를 만난다면
        오래갈 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '빨리 도망쳐!',
        소개멘트: `최악의 궁합`,
        입력값멘트: `놓아버리는 그 순간까지 계속해서 충돌합니다.
        마음을 비운 후에 오히려 편안해질 수 있어요.
        풀리지 않는 관계에 너무 집착하지 않으셔도 됩니다.`
    },
    INFP: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ESFP: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
        그렇지만 달라서 부딪히기도 해요.
        서로 숨통을 틔워주면서 상대의 생각을 이해하려고
        노력한다면 오래갈 수 있을 거에요.`
    },
    ENFP: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `나무에게서 도움을 받는 소년이군요.
        당신이 갖고 있지 않은 뭔가를 상대로부터 원하고
        상대도 건방진 나무긴 하지만, 얻을 게 없을 때
        바로 떠나버리는건 좀 슬프네요`
    },

    ENFJ: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '가면속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '우리 사이는 여기까지',
        소개멘트: `안전 거리 확보`,
        입력값멘트: `적절한 거리를 유지하기가 어려워요.
        가까우면 가까운 대로 실망하고, 그렇다고 멀어지면
        그간의 믿음이 흔들려요.
        상대는 그렇게 나쁜 사람이 아니라는 걸 늘 명심하세요.`
    },
    ISTJ: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '편하기 때문에 가능한',
        소개멘트: `절전모드`,
        입력값멘트: `알 수 없는 특우의 편안함이 있어요.
        너무 깊게 서로의 의도를 파악하려 하지만 않는다면
        오히려 오랫동안 좋은 사이로 지낼 수 있을 거에요.`
    },
    ISTP: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 보는 며느리군요.
        상대의 말과 행동이 신경이 쓰여요.
        상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
    },
    INTP: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ESTP: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    ENTP: {
        상대MBTI: ['ENTJ'],
        상대MBTIresult: '미련 없이 놓는 관계',
        소개멘트: `각자 마이웨이`,
        입력값멘트: `서로 저기가 더 잘났다고 생각하네요.
        상대를 이해하는 것도 피곤해요.
        그래도 서로에게 매력을 느낀다면 평화롭게
        관계를 지속할 수 있어요.`
    },
    //ESFJ
    ENFJ: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '편하기 때문에 가능한',
        소개멘트: `절전모드`,
        입력값멘트: `알 수 없는 특우의 편안함이 있어요.
        너무 깊게 서로의 의도를 파악하려 하지만 않는다면
        오히려 오랫동안 좋은 사이로 지낼 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '우리 사이는 딱 여기까지',
        소개멘트: `안전 거리 확보`,
        입력값멘트: `적절한 거리를 유지하기가 어려워요.
        가까우면 가까운 대로 실망하고, 그렇다고 멀어지면
        그간의 믿음이 흔들려요.
        상대는 그렇게 나쁜 사람이 아니라는 걸 늘 명심하세요.`
    },
    ISFP: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    INFP: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ESFP: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '미련 없이 놓는 관계',
        소개멘트: `각자 마이웨이`,
        입력값멘트: `서로 저기가 더 잘났다고 생각하네요.
        상대를 이해하는 것도 피곤해요.
        그래도 서로에게 매력을 느낀다면 평화롭게
        관계를 지속할 수 있어요.`
    },
    ENFP: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `나무에게서 도움을 받는 소년이군요.
        당신이 갖고 있지 않은 뭔가를 상대로부터 원하고
        상대도 건방진 나무긴 하지만, 얻을 게 없을 때
        바로 떠나버리는건 좀 슬프네요`
    },
    ENTJ: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
        싸울 일이 거의 없고 편안해요.
        실질적으로 도움이 되지 않더라도 서로를
        도우려는 마음씨가 참 예쁘네요.`
    },

    INTJ: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '당신이 꿈꾸던 소울메이트',
        소개멘트: `영혼의 단짝`,
        입력값멘트: `최상의 MBTI 궁합을 자랑하는 사이입니다.
        서로가 서로를 있는 그대로 아껴줘요.
        서로의 가치를 알아봐주는 상대를 만난다면
        오래갈 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '미친 속도로 올라갔다 내려갔다하는',
        소개멘트: `롤러코스터`,
        입력값멘트: `주기적으로 엄청나게 불타올랐다가 말도 안되게 식어요.
        너무나 잘 맞지만, 동시에 알 수 없는 삐걱거림이 있어요.
        불나방 같은 관계가 될 수 있습니다.`
    },
    ISTP: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 보는 며느리군요.
        상대의 말과 행동이 신경이 쓰여요.
        상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
    },
    INTP: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '빨리 도망쳐!',
        소개멘트: `최악의 궁합`,
        입력값멘트: `놓아버리는 그 순간까지 계속해서 충돌합니다.
        마음을 비운 후에 오히려 편안해질 수 있어요.
        풀리지 않는 관계에 너무 집착하지 않으셔도 됩니다.`
    },
    ESTP: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    ENTP: {
        상대MBTI: ['ESFJ'],
        상대MBTIresult: '달라서 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
        그렇지만 달라서 부딪히기도 해요.
        서로 숨통을 틔워주면서 상대의 생각을 이해하려고
        노력한다면 오래갈 수 있을 거에요.`
    },
    //ESTJ
    ENFJ: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '당신이 꿈꾸던 소울메이트',
        소개멘트: `영혼의 단짝`,
        입력값멘트: `최상의 MBTI 궁합을 자랑하는 사이입니다.
        서로가 서로를 있는 그대로 아껴줘요.
        서로의 가치를 알아봐주는 상대를 만난다면
        오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '미친 속도로 올라갔다 내려갔다하는',
        소개멘트: `롤러코스터`,
        입력값멘트: `주기적으로 엄청나게 불타올랐다가 말도 안되게 식어요.
        너무나 잘 맞지만, 동시에 알 수 없는 삐걱거림이 있어요.
        불나방 같은 관계가 될 수 있습니다.`
    },
    ISFP: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    INFP: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '빨리 도망쳐!',
        소개멘트: `최악의 궁합`,
        입력값멘트: `놓아버리는 그 순간까지 계속해서 충돌합니다.
        마음을 비운 후에 오히려 편안해질 수 있어요.
        풀리지 않는 관계에 너무 집착하지 않으셔도 됩니다.`
    },
    ESFP: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌 없이 주는 나무와 소년`,
        입력값멘트: `나무에게서 도움을 받는 소년이군요.
        당신이 갖고 있지 않은 뭔가를 상대로부터 원하고
        상대도 건방진 나무긴 하지만, 얻을 게 없을 때
        바로 떠나버리는건 좀 슬프네요.`
    },
    ENFP: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
        그렇지만 달라서 부딪히기도 해요.
        서로 숨통을 틔워주면서 상대의 생각을 이해하려고
        노력한다면 오래갈 수 있을 거에요.`
    },
    ENTJ: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '편하기 때문에 가능한',
        소개멘트: `절전모드`,
        입력값멘트: `알 수 없는 특우의 편안함이 있어요.
        너무 깊게 서로의 의도를 파악하려 하지만 않는다면
        오히려 오랫동안 좋은 사이로 지낼 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '우리 사이는 딱 여기까지',
        소개멘트: `안전 거리 확보`,
        입력값멘트: `적절한 거리를 유지하기가 어려워요.
        가까우면 가까운 대로 실망하고, 그렇다고 멀어지면
        그간의 믿음이 흔들려요.
        상대는 그렇게 나쁜 사람이 아니라는 걸 늘 명심하세요.`
    },
    ISTP: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    INTP: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 보는 며느리군요.
        상대의 말과 행동이 신경이 쓰여요.
        상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
    },
    ESTP: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '미련 없이 놓는 관계',
        소개멘트: `각자 마이웨이`,
        입력값멘트: `서로 저기가 더 잘났다고 생각하네요.
        상대를 이해하는 것도 피곤해요.
        그래도 서로에게 매력을 느낀다면 평화롭게
        관계를 지속할 수 있어요.`
    },
    ENTP: {
        상대MBTI: ['ESTJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    //ENFP
    ENFJ: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ISFJ: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ISFP: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '미친 속도로 올라갔다 내려갔다하는',
        소개멘트: `롤러코스터`,
        입력값멘트: `주기적으로 엄청나게 불타올랐다가 말도 안되게 식어요.
        너무나 잘 맞지만, 동시에 알 수 없는 삐걱거림이 있어요.
        불나방 같은 관계가 될 수 있습니다.`
    },
    INFP: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '우리 사이는 딱 여기까지',
        소개멘트: `안전 거리 확보`,
        입력값멘트: `적절한 거리를 유지하기가 어려워요.
        가까우면 가까운 대로 실망하고, 그렇다고 멀어지면
        그간의 믿음이 흔들려요.
        상대는 그렇게 나쁜 사람이 아니라는 걸 늘 명심하세요.`
    },
    ESFP: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ENFP: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ENTJ: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 보는 며느리군요.
        상대의 말과 행동이 신경이 쓰여요.
        상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
    },
    ISTJ: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '빨리 도망쳐!',
        소개멘트: `최악의 궁합`,
        입력값멘트: `놓아버리는 그 순간까지 계속해서 충돌합니다.
        마음을 비운 후에 오히려 편안해질 수 있어요.
        풀리지 않는 관계에 너무 집착하지 않으셔도 됩니다.`
    },
    ISTP: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '당신이 꿈꾸던 소울메이트',
        소개멘트: `영혼의 단짝`,
        입력값멘트: `최상의 MBTI 궁합을 자랑하는 사이입니다.
        서로가 서로를 있는 그대로 아껴줘요.
        서로의 가치를 알아봐주는 상대를 만난다면
        오래갈 수 있을 거에요.`
    },
    INTP: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '편하기 때문에 가능한',
        소개멘트: `절전모드`,
        입력값멘트: `알 수 없는 특우의 편안함이 있어요.
        너무 깊게 서로의 의도를 파악하려 하지만 않는다면
        오히려 오랫동안 좋은 사이로 지낼 수 있을 거에요.`
    },
    ESTP: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '끊임없는 충돌',
        소개멘트: `파이터클럽`,
        입력값멘트: `달라서 신기하고 호기심을 자극해요.
        친해지고 난 다음에는 서로 굽히지 않아서 부딪히게 됩니다.
        처음 느꼈던 신비로움을 잊지 마세요.`
    },
    ENTP: {
        상대MBTI: ['ENFP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    //ENTP
    ENFJ: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ISFJ: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '빨리 도망쳐!',
        소개멘트: `최악의 궁합`,
        입력값멘트: `놓아버리는 그 순간까지 계속해서 충돌합니다.
        마음을 비운 후에 오히려 편안해질 수 있어요.
        풀리지 않는 관계에 너무 집착하지 않으셔도 됩니다.`
    },
    ISFP: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '당신이 꿈꾸던 소울메이트',
        소개멘트: `영혼의 단짝`,
        입력값멘트: `최상의 MBTI 궁합을 자랑하는 사이입니다.
            서로가 서로를 있는 그대로 아껴줘요.
            서로의 가치를 알아봐주는 상대를 만난다면
            오래갈 수 있을 거에요.`
    },
    INFP: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '편하기 때문에 가능한',
        소개멘트: `절전모드`,
        입력값멘트: `알 수 없는 특우의 편안함이 있어요.
        너무 깊게 서로의 의도를 파악하려 하지만 않는다면
        오히려 오랫동안 좋은 사이로 지낼 수 있을 거에요.`
    },
    ESFP: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '끊임없는 충돌',
        소개멘트: `파이터클럽`,
        입력값멘트: `달라서 신기하고 호기심을 자극해요.
        친해지고 난 다음에는 서로 굽히지 않아서 부딪히게 됩니다.
        처음 느꼈던 신비로움을 잊지 마세요.`
    },
    ENFP: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
        그렇지만 달라서 부딪히기도 해요.
        서로 숨통을 틔워주면서 상대의 생각을 이해하려고
        노력한다면 오래갈 수 있을 거에요.`
    },
    ENTJ: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌 없이 주는 나무와 소년`,
        입력값멘트: `나무에게서 도움을 받는 소년이군요.
        당신이 갖고 있지 않은 뭔가를 상대로부터 원하고
        상대도 건방진 나무긴 하지만, 얻을 게 없을 때
        바로 떠나버리는건 좀 슬프네요.`
    },

    INTJ: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ISTJ: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 보는 며느리군요.
        상대의 말과 행동이 신경이 쓰여요.
        상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
    },
    ISTP: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '미친 속도로 올라갔다 내려갔다하는',
        소개멘트: `롤러코스터`,
        입력값멘트: `주기적으로 엄청나게 불타올랐다가 말도 안되게 식어요.
            너무나 잘 맞지만, 동시에 알 수 없는 삐걱거림이 있어요.
            불나방 같은 관계가 될 수 있습니다.`
    },
    INTP: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '우리 사이는 여기까지',
        소개멘트: `안전 거리 확보`,
        입력값멘트: `적절한 거리를 유지하기가 어려워요.
        가까우면 가까운 대로 실망하고, 그렇다고 멀어지면
        그간의 믿음이 흔들려요.
        상대는 그렇게 나쁜 사람이 아니라는 걸 늘 명심하세요.`
    },
    ESTP: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ENTP: {
        상대MBTI: ['ENTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
            그렇지만 또 서로 같기 때문에 금방 질릴 수 있어요 조화롭게 성격을
            맞춰 나가고, 서로에 대한 흥미를 잃지 않는다면
            서로 더 오래갈 수 있을 거에요!`
    },
    //ESFP
    ENFJ: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
            상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
            그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
            상대는 바로 떠날 꺼에요.`
    },
    ESFJ: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ISFJ: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ISFP: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '우리 사이는 딱 여기까지',
        소개멘트: `안전 거리 확보`,
        입력값멘트: `적절한 거리를 유지하기가 어려워요.
        가까우면 가까운 대로 실망하고, 그렇다고 멀어지면
        그간의 믿음이 흔들려요.
        상대는 그렇게 나쁜 사람이 아니라는 걸 늘 명심하세요.`
    },
    INFP: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '미친 속도로 올라갔다 내려갔다하는',
        소개멘트: `롤러코스터`,
        입력값멘트: `주기적으로 엄청나게 불타올랐다가 말도 안되게 식어요.
            너무나 잘 맞지만, 동시에 알 수 없는 삐걱거림이 있어요.
            불나방 같은 관계가 될 수 있습니다.`
    },
    ESFP: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ENFP: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ENTJ: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ESTJ: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
            상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
            그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
            상대는 바로 떠날 꺼에요.`
    },

    INTJ: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '빨리 도망쳐!',
        소개멘트: `최악의 궁합`,
        입력값멘트: `놓아버리는 그 순간까지 계속해서 충돌합니다.
        마음을 비운 후에 오히려 편안해질 수 있어요.
        풀리지 않는 관계에 너무 집착하지 않으셔도 됩니다.`
    },
    ISTJ: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 보는 며느리군요.
            상대의 말과 행동이 신경이 쓰여요.
            상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
    },
    ISTP: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '편하기 때문에 가능한',
        소개멘트: `절전모드`,
        입력값멘트: `알 수 없는 특우의 편안함이 있어요.
            너무 깊게 서로의 의도를 파악하려 하지만 않는다면
            오히려 오랫동안 좋은 사이로 지낼 수 있을 거에요.`
    },
    INTP: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '당신이 꿈꾸던 소울메이트',
        소개멘트: `영혼의 단짝`,
        입력값멘트: `최상의 MBTI 궁합을 자랑하는 사이입니다.
            서로가 서로를 있는 그대로 아껴줘요.
            서로의 가치를 알아봐주는 상대를 만난다면
            오래갈 수 있을 거에요.`
    },
    ENTP: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '끊임없는 충돌',
        소개멘트: `파이터클럽`,
        입력값멘트: `달라서 신기하고 호기심을 자극해요.
        친해지고 난 다음에는 서로 굽히지 않아서 부딪히게 됩니다.
        처음 느꼈던 신비로움을 잊지 마세요.`
    },
    ESTP: {
        상대MBTI: ['ESFP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    //INFJ
    ENFJ: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `나무에게서 도움을 받는 소년이군요.
            당신이 갖고 있지 않은 뭔가를 상대로부터 원하고
            상대도 건방진 나무긴 하지만, 얻을 게 없을 때
            바로 떠나버리는건 좀 슬프네요`
    },
    INFP: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '미련 없이 놓는 관계',
        소개멘트: `각자 마이웨이`,
        입력값멘트: `서로 저기가 더 잘났다고 생각하네요.
        상대를 이해하는 것도 피곤해요.
        그래도 서로에게 매력을 느낀다면 평화롭게
        관계를 지속할 수 있어요.`
    },
    ESFP: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ENFP: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTJ: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ISTJ: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '끊임없는 충돌',
        소개멘트: `파이터클럽`,
        입력값멘트: `달라서 신기하고 호기심을 자극해요.
        친해지고 난 다음에는 서로 굽히지 않아서 부딪히게 됩니다.
        처음 느꼈던 신비로움을 잊지 마세요.`
    },
    ISTP: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    INTP: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    ESTP: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '빨리 도망쳐!',
        소개멘트: `최악의 궁합`,
        입력값멘트: `놓아버리는 그 순간까지 계속해서 충돌합니다.
            마음을 비운 후에 오히려 편안해질 수 있어요.
            풀리지 않는 관계에 너무 집착하지 않으셔도 됩니다.`
    },
    ENTP: {
        상대MBTI: ['INFJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    //INTJ
    ENFJ: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '끊임없는 충돌',
        소개멘트: `파이터클럽`,
        입력값멘트: `달라서 신기하고 호기심을 자극해요.
        친해지고 난 다음에는 서로 굽히지 않아서 부딪히게 됩니다.
        처음 느꼈던 신비로움을 잊지 마세요.`
    },
    ISFP: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    INFP: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    ESFP: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ENFP: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTJ: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ISTP: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    INTP: {
        상대MBTI: ['INTJ'],
        소개멘트: `각자 마이웨이`,
        입력값멘트: `서로 저기가 더 잘났다고 생각하네요.
        상대를 이해하는 것도 피곤해요.
        그래도 서로에게 매력을 느낀다면 평화롭게
        관계를 지속할 수 있어요.`
    },
    ESTP: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 보는 며느리군요.
            상대의 말과 행동이 신경이 쓰여요.
            상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
    },
    ENTP: {
        상대MBTI: ['INTJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    //INFP
    ENFJ: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    ISFP: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    INFP: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ESFP: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ENFP: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTJ: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ISTP: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '끊임없는 충돌',
        소개멘트: `파이터클럽`,
        입력값멘트: `달라서 신기하고 호기심을 자극해요.
        친해지고 난 다음에는 서로 굽히지 않아서 부딪히게 됩니다.
        처음 느꼈던 신비로움을 잊지 마세요.`
    },
    INTP: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESTP: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '당신이 꿈꾸던 소울메이트',
        소개멘트: `영혼의 단짝`,
        입력값멘트: `최상의 MBTI 궁합을 자랑하는 사이입니다.
            서로가 서로를 있는 그대로 아껴줘요.
            서로의 가치를 알아봐주는 상대를 만난다면
            오래갈 수 있을 거에요.`
    }, //INTP
    ENTP: {
        상대MBTI: ['INFP'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    ENFJ: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '끊임없는 충돌',
        소개멘트: `파이터클럽`,
        입력값멘트: `달라서 신기하고 호기심을 자극해요.
        친해지고 난 다음에는 서로 굽히지 않아서 부딪히게 됩니다.
        처음 느꼈던 신비로움을 잊지 마세요.`
    },
    INFP: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ESFP: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ENFP: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTJ: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    ISTP: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    INTP: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
            그렇지만 또 서로 같기 때문에 금방 질릴 수 있어요 조화롭게 성격을
            맞춰 나가고, 서로에 대한 흥미를 잃지 않는다면
            서로 더 오래갈 수 있을 거에요!`
    },
    ESTP: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '미친 속도로 올라갔다 내려갔다하는',
        소개멘트: `롤러코스터`,
        입력값멘트: `주기적으로 엄청나게 불타올랐다가 말도 안되게 식어요.
        너무나 잘 맞지만, 동시에 알 수 없는 삐걱거림이 있어요.
        불나방 같은 관계가 될 수 있습니다.`
    },
    ENTP: {
        상대MBTI: ['INTP'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    //INTP
    ENFJ: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '미련 없이 놓는 관계',
        소개멘트: `각자 마이웨이`,
        입력값멘트: `서로 저기가 더 잘났다고 생각하네요.
        상대를 이해하는 것도 피곤해요.
        그래도 서로에게 매력을 느낀다면 평화롭게
        관계를 지속할 수 있어요.`
    },
    INFP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ESFP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ENFP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTJ: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ISTP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    INTP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ESTP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 보는 며느리군요.
            상대의 말과 행동이 신경이 쓰여요.
            상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
    },
    ENTP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    //    ISFP
    ENFJ: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFP: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ESFP: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ENFP: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTJ: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    ISTP: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    INTP: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ESTP: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '편하기 때문에 가능한',
        소개멘트: `절전모드`,
        입력값멘트: `알 수 없는 특우의 편안함이 있어요.
            너무 깊게 서로의 의도를 파악하려 하지만 않는다면
            오히려 오랫동안 좋은 사이로 지낼 수 있을 거에요.`
    },
    ENTP: {
        상대MBTI: ['ISFP'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    //    ISTJ
    ENFJ: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFP: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ESFP: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ENFP: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTJ: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTP: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '미련 없이 놓는 관계',
        소개멘트: `각자 마이웨이`,
        입력값멘트: `서로 저기가 더 잘났다고 생각하네요.
        상대를 이해하는 것도 피곤해요.
        그래도 서로에게 매력을 느낀다면 평화롭게
        관계를 지속할 수 있어요.`
    },
    INTP: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ESTP: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTP: {
        상대MBTI: ['ISTJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    //    ISTP
    ENFJ: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFP: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ESFP: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ENFP: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTJ: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTP: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INTP: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ESTP: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '우리 사이는 딱 여기까지',
        소개멘트: `안전 거리 확보`,
        입력값멘트: `적절한 거리를 유지하기가 어려워요.
        가까우면 가까운 대로 실망하고, 그렇다고 멀어지면
        그간의 믿음이 흔들려요.
        상대는 그렇게 나쁜 사람이 아니라는 걸 늘 명심하세요.`
    },
    ENTP: {
        상대MBTI: ['ISTP'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    //    ESTP
    ENFJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ESFP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ENFP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INTP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ESTP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    //ESTP
    ENFJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '가면 속 너는 어떤 모습일까?',
        소개멘트: `가장무도회`,
        입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
        나와 다른 관점을 이해해주고 배울 점을 찾는다면
        오래갈 수 있을 거에요.`
    },
    ESFJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INFP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ESFP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 주는 시어머니군요.
        선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
        조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    },
    ENFP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '넌 오른손, 난 왼손',
        소개멘트: `거울에 비친 나`,
        입력값멘트: `비슷한 듯 달라요.
        그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
        그래도 대부분 좋은 친구 사이에요.`
    },
    ENTJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ESTJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },

    INTJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTJ: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISTP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    INTP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ESTP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ENTP: {
        상대MBTI: ['ESTP'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    }
};
export default mbtiInfo;

// export default {
//     //ENFJ
//     ENFJ: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '자기 객관화를 도와주는',
//         소개멘트: `CTRL + C, CTRL + V`,
//         입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
//             그렇지만 또 서로 같기 때문에 금방 질릴 수 있어요 조화롭게 성격을
//             맞춰 나가고, 서로에 대한 흥미를 잃지 않는다면
//             서로 더 오래갈 수 있을 거에요!`
//     },
//     ESFJ: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '가면 속 너는 어떤 모습일까?',
//         소개멘트: `가장무도회`,
//         입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
//             나와 다른 관점을 이해해주고 배울 점을 찾는다면
//             오래갈 수 있을 거에요.`
//     },
//     INFJ: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '우리 사이는 딱 여기까지',
//         소개멘트: `안전 거리 확보`,
//         입력값멘트: `적절한 거리를 유지하기가 어려워요.
//             가까우면 가까운 대로 실망하고, 그렇다고 멀어지면
//             그간의 믿음이 흔들려요.
//             상대는 그렇게 나쁜 사람이 아니라는 걸 늘 명심하세요.`
//     },
//     ISFJ: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '편하기 때문에 가능한',
//         소개멘트: `절전모드`,
//         입력값멘트: `알 수 없는 특우의 편안함이 있어요.
//             너무 깊게 서로의 의도를 파악하려 하지만 않는다면
//             오히려 오랫동안 좋은 사이로 지낼 수 있을 거에요.`
//     },
//     ISFP: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '감시하고 눈치보는',
//         소개멘트: `고부관계`,
//         입력값멘트: `고부관계의 눈치 보는 며느리군요.
//             상대의 말과 행동이 신경이 쓰여요.
//             상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
//     },
//     INFP: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '넌 오른손, 난 왼손',
//         소개멘트: `거울에 비친 나`,
//         입력값멘트: `비슷한 듯 달라요.
//             그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
//             그래도 대부분 좋은 친구 사이에요.`
//     },
//     ESFP: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '다소 건방진',
//         소개멘트: `아낌없이 주는 나무와 소년`,
//         입력값멘트: `다소 건방진 나무군요.
//             상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
//             그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
//             상대는 바로 떠날 꺼에요.`
//     },
//     ENFP: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '미련없이 놓는 관계',
//         소개멘트: `각자 마이웨이`,
//         입력값멘트: `서로 자기가 더 잘났다고 생각하네요.
//             상대를 이해하는 것도 피곤해요.
//             그래도 서로에게 매력을 느낀다면 평화롭게
//             관계를 지속할 수 있어요.`
//     },
//     ENTJ: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '쿵짝이 잘 맞는',
//         소개멘트: `케미폭발 찐친`,
//         입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
//             싸울 일이 거의 없고 편안해요.
//             실질적으로 도움이 되지 않더라도 서로를
//             도우려는 마음씨가 참 예쁘네요.`
//     },
//     ESTJ: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '끝임없는 충돌',
//         소개멘트: `파이터클럽`,
//         입력값멘트: `달라서 신기하고 호기심을 자극해요.
//             친해지고 난 다음에는 서로 굽히지 않아서 부딪히게 됩니다.
//             처음 느꼈던 신비로움을 잊지 마세요.`
//     },

//     INTJ: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '미친 속도로 올라갔다 내려갔다하는',
//         소개멘트: `롤러코스터`,
//         입력값멘트: `주기적으로 엄청나게 불타올랐다가 말도 안되게 식어요.
//             너무나 잘 맞지만, 동시에 알 수 없는 삐걱거림이 있어요.
//             불나방 같은 관계가 될 수 있습니다.`
//     },
//     ISTJ: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '당신이 꿈꾸던 소울메이트',
//         소개멘트: `영혼의 단짝`,
//         입력값멘트: `최상의 MBTI 궁합을 자랑하는 사이입니다.
//             서로가 서로를 있는 그대로 아껴줘요.
//             서로의 가치를 알아봐주는 상대를 만난다면
//             오래갈 수 있을 거에요.`
//     },
//     ISTP: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '빨리 도망쳐!',
//         소개멘트: `최악의 궁합`,
//         입력값멘트: `놓아버리는 그 순간까지 계속해서 충돌합니다.
//             마음을 비운 후에 오히려 편안해질 수 있어요.
//             풀리지 않는 관계에 너무 집착하지 않으셔도 됩니다.`
//     },
//     INTP: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '감시하고 눈치보는',
//         소개멘트: `고부관계`,
//         입력값멘트: `고부관계의 눈치 주는 시어머니군요.
//             선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
//             조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
//     },
//     ESTP: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '달라서 딱 맞는',
//         소개멘트: `볼트와 너트`,
//         입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
//             그렇지만 달라서 부딪히기도 해요.
//             서로 숨통을 틔워주면서 상대의 생각을 이해하려고
//             노력한다면 오래갈 수 있을 거에요.`
//     },
//     ENTP: {
//         상대MBTI: ['ENFJ'],
//         상대MBTIresult: '다소 건방진',
//         소개멘트: `아낌없이 주는 나무와 소년`,
//         입력값멘트: `나무에게서 도움을 받는 소년이군요.
//             당신이 갖고 있지 않은 뭔가를 상대로부터 원하고
//             상대도 건방진 나무긴 하지만, 얻을 게 없을 때
//             바로 떠나버리는건 좀 슬프네요`
//     }
// };
