export const mbtiInfo = {
    //INTP
    // ENFJ: {
    //     상대MBTI: ['ISFJ'],
    //     상대MBTIresult: '가면 속 너는 어떤 모습일까?',
    //     소개멘트: `가장무도회`,
    //     입력값멘트: `겉보기에는 둘이 비슷해 보여도 속으로는 전혀 다른 생각을 하고 있어요.
    //     나와 다른 관점을 이해해주고 배울 점을 찾는다면
    //     오래갈 수 있을 거에요.`
    // },
    // ESFJ: {
    //     상대MBTI: ['ISFJ'],
    //     상대MBTIresult: '자기 객관화를 도와주는',
    //     소개멘트: `CTRL + C, CTRL + V`,
    //     입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
    //     그렇지만 또 같기 때문에 금방 질질 수 있어요
    //     조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
    //     잃지 않는다면 오래갈 수 있을 거에요.`
    // },
    // INFJ: {
    //     상대MBTI: ['ISFJ'],
    //     상대MBTIresult: '자기 객관화를 도와주는',
    //     소개멘트: `CTRL + C, CTRL + V`,
    //     입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
    //     그렇지만 또 같기 때문에 금방 질질 수 있어요
    //     조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
    //     잃지 않는다면 오래갈 수 있을 거에요.`
    // },
    ISFJ: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '자기 객관화를 도와주는',
        소개멘트: `CTRL + C, CTRL + V`,
        입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
        그렇지만 또 같기 때문에 금방 질질 수 있어요
        조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
        잃지 않는다면 오래갈 수 있을 거에요.`
    },
    ISFP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '미련 없이 놓는 관계',
        소개멘트: `각자 마이웨이`,
        입력값멘트: `서로 저기가 더 잘났다고 생각하네요.
        상대를 이해하는 것도 피곤해요.
        그래도 서로에게 매력을 느낀다면 평화롭게
        관계를 지속할 수 있어요.`
    },
    // INFP: {
    //     상대MBTI: ['ISFJ'],
    //     상대MBTIresult: '자기 객관화를 도와주는',
    //     소개멘트: `CTRL + C, CTRL + V`,
    //     입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
    //     그렇지만 또 같기 때문에 금방 질질 수 있어요
    //     조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
    //     잃지 않는다면 오래갈 수 있을 거에요.`
    // },
    // ESFP: {
    //     상대MBTI: ['ISFJ'],
    //     상대MBTIresult: '감시하고 눈치보는',
    //     소개멘트: `고부관계`,
    //     입력값멘트: `고부관계의 눈치 주는 시어머니군요.
    //     선의에서 우러 나온 말과 행동에도 상대는 신경이 쓰여요.
    //     조금만 부드럽게 대해주면 더 따뜻한 관계가 될 거에요.`
    // },
    // ENFP: {
    //     상대MBTI: ['ISFJ'],
    //     상대MBTIresult: '넌 오른손, 난 왼손',
    //     소개멘트: `거울에 비친 나`,
    //     입력값멘트: `비슷한 듯 달라요.
    //     그래서 서로 보완해줄 수도 있고, 갈등이 생기기고 해요.
    //     그래도 대부분 좋은 친구 사이에요.`
    // },
    // ENTJ: {
    //     상대MBTI: ['ISFJ'],
    //     상대MBTIresult: '쿵짝이 잘 맞는',
    //     소개멘트: `케미폭발 찐친`,
    //     입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
    //         싸울 일이 거의 없고 편안해요.
    //         실질적으로 도움이 되지 않더라도 서로를
    //         도우려는 마음씨가 참 예쁘네요.`
    // },
    // ESTJ: {
    //     상대MBTI: ['ISFJ'],
    //     상대MBTIresult: '자기 객관화를 도와주는',
    //     소개멘트: `CTRL + C, CTRL + V`,
    //     입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
    //     그렇지만 또 같기 때문에 금방 질질 수 있어요
    //     조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
    //     잃지 않는다면 오래갈 수 있을 거에요.`
    // },

    // INTJ: {
    //     상대MBTI: ['ISFJ'],
    //     상대MBTIresult: '자기 객관화를 도와주는',
    //     소개멘트: `CTRL + C, CTRL + V`,
    //     입력값멘트: `서로의 MBTI가 같기 때문에 서로를 더 잘 이해하고 공감해줘요!
    //     그렇지만 또 같기 때문에 금방 질질 수 있어요
    //     조화롭게 성격을 맞춰 나가고, 서로에 대한 흥미를
    //     잃지 않는다면 오래갈 수 있을 거에요.`
    // },
    ISTJ: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '쿵짝이 잘 맞는',
        소개멘트: `케미폭발 찐친`,
        입력값멘트: `서로 이해하기 쉽고 함께 있으면 즐거워요.
            싸울 일이 거의 없고 편안해요.
            실질적으로 도움이 되지 않더라도 서로를
            도우려는 마음씨가 참 예쁘네요.`
    },
    ISTP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '다소 건방진',
        소개멘트: `아낌없이 주는 나무와 소년`,
        입력값멘트: `다소 건방진 나무군요.
        상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
        그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
        상대는 바로 떠날 꺼에요.`
    },
    INTP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '달라서 딱 맞는',
        소개멘트: `볼트와 너트`,
        입력값멘트: `다르기 떄문에 더 알고 싶고 재미있어요.
            그렇지만 달라서 부딪히기도 해요.
            서로 숨통을 틔워주면서 상대의 생각을 이해하려고
            노력한다면 오래갈 수 있을 거에요.`
    },
    ESTP: {
        상대MBTI: ['ISFJ'],
        상대MBTIresult: '감시하고 눈치보는',
        소개멘트: `고부관계`,
        입력값멘트: `고부관계의 눈치 보는 며느리군요.
            상대의 말과 행동이 신경이 쓰여요.
            상대를 조금만 더 쉽게 생각하면 더 편한 사이가 될 거에요.`
    }
    // ENTP: {
    //     상대MBTI: ['ISFJ'],
    //     상대MBTIresult: '다소 건방진',
    //     소개멘트: `아낌없이 주는 나무와 소년`,
    //     입력값멘트: `다소 건방진 나무군요.
    //     상대에게 당신이 어떤 방식으로든 도움이 된 다는 걸 알고 있어요.
    //     그렇지만 조심하세요! 당신에게서 얻을 게 없을 때
    //     상대는 바로 떠날 꺼에요.`
    // }
};
