export const questions = [
    // I/E 질문
    {
        question: '새로운 사람들과의 소규모 모임에서 당신은 어떤가요?',
        option1: '1. 한 두 명의 친구와 조용한 대화를 즐깁니다. ',
        option2: '2. 많은 사람들과 함께 어울리며 활기찬 분위기를 선호합니다. '
    },
    {
        question: '힘든 상황에서 당신은 어떻게 에너지를 얻나요?',
        option1: '1. 혼자서 조용한 공간에서 생각에 잠깁니다. ',
        option2: '2. 다른 사람들과 소통하며 그들로부터 지지를 얻습니다. '
    },
    {
        question: '새로운 경험이나 활동을 시도할 때 당신은 어떤가요?',
        option1: '1. 신중하게 준비하고 혼자서 천천히 즐깁니다. ',
        option2: '2. 빠르게 도전하며 다른 사람들과 함께 하고 싶어합니다. '
    },
    {
        question: '회의나 모임에서 당신이 선호하는 역할은 무엇인가요?',
        option1: '1. 주로 듣는 쪽으로 참여하며 자신의 의견을 조용히 표현합니다. ',
        option2: '2. 활발하게 대화에 참여하며 다른 사람들을 이끌어 나갑니다. '
    },
    {
        question: '일을 하는 방식에 대한 당신의 선호도는 어떤가요?',
        option1: '1. 혼자서 조용하게 일하며 집중합니다. ',
        option2: '2. 다른 사람들과 협력하며 함께 일하는 것을 선호합니다. '
    },
    // S/N 질문
    {
        question: '집을 보러 갔을 때, 무엇을 보시나요?',
        option1: '1. 연식, 방 구조, 방 턱 유무, 수압체크 등 꼼꼼하게 확인합니다.',
        option2: '2. 화사한 느낌이다, 방이 넓다, 좋다 등 느낌을 봅니다. '
    },
    {
        question: '롤러코스터를 탈 때 어떤 생각이 드시나요?',
        option1: '1. 아 재밌겠다. 바깥쪽 자리에 앉을 걸 그랬나? 라는 생각 등을 합니다. ',
        option2: '2. 중간에 볼트가 풀려서 롤러코스터가 공중에서 한 바퀴 돌면 어떡하지? 등의 생각을 합니다. '
    },
    {
        question: '새 스마트폰을 구입했을 때 하는 행동은 무엇입니까?',
        option1: '1. 설명서를 처음부터 정독하면서 어떤 기능이 있는지 봅니다. ',
        option2: '2. 스마트폰 모서리 각도는 왜 이 정도가 됐을까? 등의 생각을 합니다. '
    },
    {
        question: '요리를 할 때 하는 행동은 무엇인가요?',
        option1: '1. 레시피를 찾아서 본 후 그대로 만듭니다.',
        option2: '2. 대충 감으로 만듭니다. '
    },
    {
        question: '여행을 가기로 했다면 어떻게 하시나요?',
        option1: '1. 여행지에 관한 정보를 찾아 봅니다. ',
        option2: '2. 여행을 떠나는 상상을 합니다. '
    },
    // F/T 질문
    {
        question: '갈등 상황에서, 당신의 결정은 어떻게 이루어지나요?',
        option1: '1. 모든 사람의 감정을 고려합니다. ',
        option2: '2. 객관적인 판단을 토대로 결정을 내리려고 합니다. '
    },
    {
        question: '문제 해결 시, 당신이 중요하게 생각하는 것은 무엇인가요?',
        option1: '1. 다른 사람의 감정은 어떨지 생각합니다. ',
        option2: '2. 현실적인 문제 해결을 위해, 그에 맞는 방안을 생각합니다. '
    },
    {
        question: '다른 사람들과 목표 달성을 위해 당신이 선호하는 방식은 무엇인가요?',
        option1: '1. 대화를 통해서 감정을 공유하는 것이 중요합니다. ',
        option2: '2. 사실과 데이터를 기반으로 한 판단이 필요하다고 봅니다. '
    },
    {
        question: '자신의 의견을 표현할 때, 어떤 기준으로 결정하나요?',
        option1: '1. 다른 사람들과의 관계와 감정이 중요합니다. ',
        option2: '2. 논리적인 근거와 사실이 중요합니다. '
    },
    {
        question: '결정을 내릴 때, 어떤 가치 판단을 중요하게 여기나요?',
        option1: '1. 다른 사람의 의견과 감정에 공감하며 결정합니다. ',
        option2: '2. 데이터와 분석을 통해 문제를 이해하고 해결합니다. '
    },
    // P/J 질문
    {
        question: '계획을 세울 때, 어떤 방식으로 계획을 세우나요?',
        option1: '1. 유연하게 계획을 세우며 일상적인 일을 순간적으로 처리합니다. ',
        option2: '2. 체계적으로 계획을 세우며 일정과 목표를 명확히 설정합니다. '
    },
    {
        question: '일을 처리하는 방식에 대해 어떻게 생각하나요?',
        option1: '1. 일을 주로 그때그때 처리하며 더 유연한 접근을 선호합니다. ',
        option2: '2. 미리 계획을 세우고 일을 체계적으로 처리하는 것이 좋다고 생각합니다. '
    },
    {
        question: '남들과의 약속에 대해 어떤 태도를 가지고 있나요?',
        option1: '1. 약속 시간을 더 유연하게 다루며 상황에 따라 조절합니다. ',
        option2: '2. 정해진 약속 시간을 지키고 일을 체계적으로 합니다. '
    },
    {
        question: '새로운 계획이나 아이디어에 어떻게 반응하나요?',
        option1: '1. 융통성 있게 새로운 아이디어나 계획에 적응하려고 합니다. ',
        option2: '2. 신중하게 검토하고 계획을 변경하기 전에 신중한 판단을 내리려고 합니다. '
    },
    {
        question: '일을 마무리할 때 어떤 방식을 선호하나요?',
        option1: '1. 일이 끝나면 결과를 받아들이며 새로운 일에 더 빠르게 진행합니다. ',
        option2: '2. 일을 완료하기 전까지 기다리며 끝까지 완벽하게 처리하려고 합니다. '
    }
];
