export const questions = [
    // I/E 질문
    {
        question: '새로운 사람들과의 소규모 모임에서 당신은 어떤가요?',
        option1: '1. 한 두 명의 친구와 조용한 대화를 즐깁니다. ',
        option2: '2. 많은 사람들과 함께 어울리며 활기찬 분위기를 선호합니다. '
    },
    {
        question: '힘든 상황에서 당신은 어떻게 에너지를 얻나요?',
        option1: '1. 혼자서 조용한 공간에서 생각에 잠깁니다. ',
        option2: '2. 다른 사람들과 소통하며 그들로부터 지지를 얻습니다. '
    },
    {
        question: '새로운 경험이나 활동을 시도할 때 당신은 어떤가요?',
        option1: '1. 신중하게 준비하고 혼자서 천천히 즐깁니다. ',
        option2: '2. 빠르게 도전하며 다른 사람들과 함께 하고 싶어합니다. '
    },
    {
        question: '회의나 모임에서 당신이 선호하는 역할은 무엇인가요?',
        option1: '1. 주로 듣는 쪽으로 참여하며 자신의 의견을 조용히 표현합니다. ',
        option2: '2. 활발하게 대화에 참여하며 다른 사람들을 이끌어 나갑니다. '
    },
    {
        question: '일을 하는 방식에 대한 당신의 선호도는 어떤가요?',
        option1: '1. 혼자서 조용하게 일하며 집중합니다. ',
        option2: '2. 다른 사람들과 협력하며 함께 일하는 것을 선호합니다. '
    },
    // N/S 질문
    {
        question: '새로운 아이디어를 받아들이는 방식에 대해 어떻게 생각하나요?',
        option1: '1. 구체적이고 현실적인 측면을 중시하며 경험을 바탕으로 합니다. ',
        option2: '2. 미래의 가능성과 추상적인 아이디어에 더 관심이 있습니다. '
    },
    {
        question: '문제 해결 시 당신의 접근 방식은 무엇인가요?',
        option1: '1. 사실과 경험을 기반으로 해결책을 찾으며 실제 상황을 고려합니다. ',
        option2: '2. 창의적인 아이디어를 활용하며 문제의 본질을 파악하려고 합니다. '
    },
    {
        question: '계획을 세울 때, 당신의 주요 고려 사항은 무엇인가요?',
        option1: '1. 실제적이고 구체적인 세부 계획을 세우며 세부 사항을 중시합니다. ',
        option2: '2. 큰 그림을 바라보며 미래의 가능성과 흐름을 고려합니다. '
    },
    {
        question: '새로운 정보를 학습할 때 당신의 선호 방식은 무엇인가요?',
        option1: '1. 실제 경험과 구체적인 사례를 통해 학습하며 실용적인 지식을 쌓습니다. ',
        option2: '2. 이론적이고 개념적인 틀을 활용하여 추상적인 개념을 이해합니다. '
    },
    {
        question: '미래에 대한 계획을 세울 때, 당신이 고려하는 요소는 무엇인가요?',
        option1: '1. 현실적인 제약 사항과 현재의 상황을 고려하여 실용적인 계획을 세우려고 합니다. ',
        option2: '2. 미래의 가능성과 전략을 고려하여 큰 그림을 그리려고 합니다. '
    },
    // F/T 질문
    {
        question: '갈등 상황에서, 당신의 결정은 어떻게 이루어지나요?',
        option1: '1. 감정적인 측면을 중시하며 모든 사람의 감정을 고려합니다. ',
        option2: '2. 논리적이고 객관적인 판단을 토대로 결정을 내리려고 합니다. '
    },
    {
        question: '문제 해결 시 당신이 주로 가치를 두는 것은 무엇인가요?',
        option1: '1. 타인의 감정과 가치에 대한 이해를 바탕으로 해결책을 찾습니다. ',
        option2: '2. 논리적인 분석과 객관적인 판단을 중시하여 문제를 해결합니다. '
    },
    {
        question: '목표 달성을 위해 당신이 선호하는 방식은 무엇인가요?',
        option1: '1. 팀원과의 협업, 감정적인 지지를 받으며 목표를 달성하려고 합니다. ',
        option2: '2. 목표를 분석하고 논리적인 계획에 따라 끈질기게 추진하려고 합니다. '
    },
    {
        question: '자신의 의견을 표현할 때, 어떤 기준으로 결정하나요?',
        option1: '1. 다른 사람들과의 관계와 감정에 중점을 두며 의견을 표현합니다. ',
        option2: '2. 논리적인 근거와 사실을 기반으로 의견을 표현하려고 합니다. '
    },
    {
        question: '결정을 내릴 때, 어떤 가치 판단을 중요하게 여기나요?',
        option1: '1. 인간적인 가치와 윤리, 도덕적인 측면을 중요시 여기며 결정합니다. ',
        option2: '2. 효율성과 논리적인 일관성을 중시하여 결정을 내리려고 합니다. '
    },
    // J/P 질문
    {
        question: '계획을 세울 때, 어떤 방식으로 계획을 세우나요?',
        option1: '1. 유연하게 계획을 세우며 일상적인 일을 순간적으로 처리합니다. ',
        option2: '2. 체계적으로 계획을 세우며 일정과 목표를 명확히 설정합니다. '
    },
    {
        question: '일을 처리하는 방식에 대해 어떻게 생각하나요?',
        option1: '1. 일을 주로 그때그때 처리하며 더 유연한 접근을 선호합니다. ',
        option2: '2. 미리 계획을 세우고 일을 체계적으로 처리하는 것이 좋다고 생각합니다. '
    },
    {
        question: '남들과의 약속에 대해 어떤 태도를 가지고 있나요?',
        option1: '1. 약속 시간을 더 유연하게 다루며 상황에 따라 조절합니다. ',
        option2: '2. 정해진 약속 시간을 지키고 일을 체계적으로 조직합니다. '
    },
    {
        question: '새로운 계획이나 아이디어에 어떻게 반응하나요?',
        option1: '1. 융통성 있게 새로운 아이디어나 계획에 적응하려고 합니다. ',
        option2: '2. 신중하게 검토하고 계획을 변경하기 전에 신중한 판단을 내리려고 합니다. '
    },
    {
        question: '일을 마무리할 때 어떤 방식을 선호하나요?',
        option1: '1. 일이 끝나면 결과를 받아들이며 새로운 일에 더 빠르게 진행합니다. ',
        option2: '2. 일을 완료하기 전까지 기다리며 끝까지 완벽하게 처리하려고 합니다. '
    }
];
