export const typeDescriptions = {
    ISTJ: `세상의 소금형 (ISTJ)
    한번 시작한 일은 끝까지 해내는 성격`,
    ISFJ: `권력형(ISFJ)
    성실하고 온화하여 협조를 잘하는 사람`,
    INFJ: `예언자형(INFJ)
    사람에 관한 뛰어난 통찰력을 가진 사람`,
    INTJ: `과학자형(INTJ)
    전체를 조합하여 비전을 제시하는 사람`,
    ISTP: `백과사전형(ISTP)
    논리적이고 뛰어난 상황 적응력`,
    ISFP: `성인군자형(ISFP)
    따뜻한 감성을 가지고 있는 겸손한 사람`,
    INFP: `잔다르크형(INFP)
    이상적인 세상을 만들어가는 사람들`,
    INTP: `아이디어형(INTP)
    비평적인 관점을 가진 뛰어난 전략가`,
    ESTP: `활동가형(ESTP)
    친구, 운동, 음식 등 다양함을 선호`,
    ESFP: `사교형(ESFP)
    분위기를 고조시키는 우호적인 성격`,
    ENFP: `스파크형(ENFP)
    열정적으로 새 관계를 만드는 사람`,
    ENTP: `발명가형(ENTP)
    풍부한 상상력으로 새로운 것에 도전`,
    ESTJ: `사업가형(ESTJ)
    사무적, 실용적, 현실적인 스타일`,
    ESFJ: `친선도모형(ESFJ)
    친절, 현실감을 바탕으로 타인에게 봉사`,
    ENFJ: `언변능숙형(ENFJ)
    타인의 성장을 도모하고 협동하는 사람`,
    ENTJ: `지도자형(ENTJ)
    비전을 갖고 타인을 활력적으로 인도`
};

export const typeDescriptionsDetails = {
    ISTJ: `-해야 할 일에 대해 논리적으로 결정하고 그 일을 흐트러짐 없이 꾸준히 해나간다.
    -정해진 일정에 맞춰 일을 마무리 짓기 때문에 주변 사람으로부터 신뢰를 얻는다.
    -약속시간 늦는것을 싫어한다.
    -원리 원칙을 포함한 질서 체계를 좋아한다.
    -반복되는 일에도 인내력이 강한 편이다.
    -다른 사람에게 관심이 없으며 공감성, 사교성이 약한 편입니다.
    -즉흥적인 것을 싫어하고 계획 세우는 것을 좋아합니다.`,
    ISFJ: `-동정심이 많고 사려 깊고 양심적인 사람이다.
    -다른 사람이 필요할 때 돌봐주는 것을 기뻐하고 친전할게 도움을 주려고 한다.
    -신절한 동료와 함께 일하는 것을 좋아한다.
    -완벽 주의 성향으로 세심하며 꼼꼼하다.
    -원칙주의자
    -부탁받으면 거절을 잘 하지 못한다.
    -허세, 잘난척 하는 사람을 싫어한다.
    -기억력이 좋은 편이다.
    -가성비를 많이 생각하는 편이다.`,
    INFJ: `-혼자 조용히 생각하며 집중할 수 있는 시간을 갖는 것이 중요하다.
    -말없이 자신의 영향력을 발휘하는 것을 좋아한다.
    -공동의 이익을 가져오는 것에 노력한다.
    -목표 달성을 위해 계획세워서 실천하는 편이다.
    -감수성이 풍부한 편 + 고독을 즐긴다.
    -평화주의자 (겉모습은 착해보이는 편) 이다.
    -말할 때 비유나 은유 등 완곡한 표현을 많이 쓴다.
    -MBTI 성향 중 가장 적은 유형 중 하나다.`,
    INTJ: `-비전 달성을 위해 시간과 노력을 아끼지 않는다.
    -체계적이며 특유의 통찰력으로 독립적인 생활을 선호한다.
    -개인주의 혹은 이기주의적 성향이다.
    -하루 계획을 세워 지내는 편이다.
    -지식에 가치를 부여하며, 새로운 내용을 배우고 깨닫는 것을 즐긴다.
    -효율적이고 업무 중심적인 분위기에서 일하는 것을 선호한다.
    -논리적 객관적이다.
    -관계 형성에 많이 서툰편이다.
    -혼자 있는 것을 선호한다.
    -전세계 인구의 2%에 해당하며 MBTI 성격유형 중 2~3번째로 희귀한 유형이다.`,
    ISTP: `-낙관적이며 느긋한 편이다.
    -간단명료하게 말하는 것을 좋아한다.
    -들어떤 일에 꽂히면 꾸준히 하는 편이다.
    -일상생활에서 구속 받는 것을 싫어한다.
    -손재주 좋아 도구를 잘 사용하는 편이다.
    -본인에게 너무 의존하는 것을 싫어한다.
    -혼자만의 시간을 즐기는 편이다. ex) 혼밥
    -생각하는 것이 단순하며 표정 변화가 거의 없는 편이다.
    -계획성은 부족하지만 효율성을 중시한다.
    -MBTI 유형 중 남녀 비율 대비 여성 비율이 가장 낮다. (남성 75%, 여성 25%)`,
    ISFP: `-다른 사람을 배려하며 자신의 생각을 다른 사람에게 강요하지 않는다.
    -예술을 매개로 하여 자신을 표현하고 싶은 경향이 있다. ex. 글쓰기
    -삶의 현재를 즐기는 사람이다.
    -다른 유형보다 예술적 감각이 뛰어나다.
    -자신을 내세우지 않는다.
    -집착하는 것을 싫어한다.
    -남 눈치를 많이 보는 편이다.
    -다른 사람 부탁 거절을 잘 못한다.
    -게으른 완벽주의자 혹은 배려형 개인주의이다.
    -추진력과 결정력 그리고 계획성 부족하다.
    -남의 말에 상처를 쉽게 받는다.`,
    INFP: `-확고한 신념을 갖고 자신의 가치를 고수해 나간다.
    -반대되는 의사나 갈등이 표출되었을 때 힘들어 한다.
    -내 사람이기전까지 표현을 잘 하지 않는다.
    -감정 기복이 심한 경우가 많다.
    -게으른 편으로 벼락치기를 많이 하는 편이다.
    -호불호가 명확한 편이다.
    -내적 성향인데도 사람들에게 관심받은 싶은 성향이 있다.
    -우유부단해서 일을 미루는 편이다.
    -타인을 잘 챙겨주지만 정작 본인을 못 챙기는 편이다.`,
    INTP: `-물음표 살인마
    -분명하고 이해가 빠른 사색가이며 깊게 몰입할 수 있는 스타일이다.
    -남에게 피해주는 거 싫어하고 관심도 별로 없다.
    -짐돌이 / 집순이가 많다.
    -호불호 확실하며 팩폭을 잘한다.
    -웬만한 일에 상처 안 받는다.
    -조용한 편이나 관심 있는 분야는 말을 잘한다.
    -장담이나 친목에는 큰 관심이 없고 소수의 사람들과 토론하는 것을 좋아한다.
    -지적 호기심을 활용할 수 있는 분야에 능력 발휘한다.
    -자료 요약하고 일반화시켜 새로운 모델을 만드는 것을 즐긴다.
    -서로 유익할 수 있는 대화를 좋아한다.
    -혼자서 공부해야 효율이 올라간다.`,
    ESTP: `-대담한 성격의 소유자이다.
    -다른 사람에게 관대하고 느긋하다.
    -주변에서 발생하는 일에 관심이 많다.
    -실용적인 방법의 새로운 시스템을 만들어 내고자한다.
    -외부로 에너지를 발산하는 것을 좋아한다.
    -삶을 재미있게 생각하려면 주변 사람을 즐겁게 해주는 편이다.
    -업무와 재미가 공존할 수 있는 일을 선호한다.
    -뒤끝 없이 쿨한 성격의 소유자이다.
    -경쟁, 내기 등 스릴 있는 것을 좋아한다.
    -감성팔이를 좋아하지 않는다.
    -어른들이 좋아하는 편이다.
    -주위에 이성친구가 많은 편이다.
    -남한테 관심 없고 생각하는 것도 귀찮다.`,
    ESFP: `-즉흥적으로 행동하기 때문에 잘 제어해야 하는 유형이다.
    -즐겁고 재미있는 인간관계만 추구한다.
    -분위기를 고조시키는 우호적인 사람들이다.
    -천성적으로 사람을 좋아하고 다른 사람과 친밀한 관계를 형성한다.
    -외부 활동을 좋아하며 즐거운 일을 찾아 다닌다.
    -다른 사람에게 직접적이고 현실적인 봉사를 하고자 한다.
    -스스로 만족하고 보상받을 수 있는 일을 찾으려고 한다.
    -업무를 하는데 있어서 체계적인 계획과 시간 관리 능력에 관심을 가질 필요가 있다.
    -성격이 다소 급한 편이다.
    -지루한 것을 싫어하면 참견을 잘하는 편이다.`,
    ENFP: `-자신의 열정을 다른 사람에게 전파하며, 새로운 자극을 제공하는 사람이다. 
    -계획보다는 즉흥적으로 일을 처리하는 편이다.
    -위기 대처능력 뛰어난 편이다.
    -멋내고 꾸미는 것을 좋아한다.
    -YOLO의 삶을 지향한다.
    -친절하고 이해심이 많은 기질을 가지고 있다.
    -직관력이 뛰어나다.
    -틀에 얽매이지 않고 적응력이 높다.`,
    ENTP: `-장의적인 방법을 빠르게 고안해내는 편이다.
    -남보다 먼저 시도하려는 경향이 있다.
    -시스템 운영 방식을 이해하는 것에 능숙하다.
    -새로운 관심사로 눈을 돌리고 새 프로젝트를 시작한다.
    -하는 것을 통해 끊임없이 에너지를 충전 받는다.
    -혼자 돌아다니는 것을 좋아한다.
    -독립심이 강한 편이다.
    -본인 의견을 끝까지 말해야 시원함을 느낀다.
    -끈기가 부족해서 뒷심이 약한 편이다.
    -분석력이 좋다.`,
    ESTJ: `-논리적이며 분석적인 것을 선호하며 활동을 조직화하고 주도해 가는 스타일이다.
    -감정이 잘 드러나며 다소 직설적인 언어로 표현하는 편이다.
    -고집이 있지만 충분히 논리적이다.
    -혼자서 일하기 싫어한다.
    -경영자(사업가)적인 기질이 있다. 
    -한번 시작한 일은 끝을 봐야 한다.
    -여행을 계획하고 움직이는 편이다.
    -겉보기에 엄격해보이지만 완숙된 스타일이라면 주변에 의리와 배려를 보여준다.
    -주위 사람들에게 인정 받는 것을 좋아한다.
    -리더 역할을 선호하지 않으나 막상 맡게되면 잘 하는 편이다.
    -싸움을 싫어하지만 싸워서 지는 것도 싫어한다.
    -공감적인 위로를 잘 못하는 편이다.
    -약속 시간 및 규칙 어기는 사람을 싫어한다.
    -정확한 피드백을 주고받기를 원한다.`,
    ESFJ: `-분위기 메이커
    -결단력이 있으며 필요한 일이라면 반드시 완수하려고 한다.
    -계획 틀어지는 것을 싫어한다.
    -고민 상담 잘 들어주는 다정다감한 스타일이다.
    -인간 관계를 소중히 하며 그것으로 스트레스를 받기 쉽다.
    -타인에게 인정받고 싶어한다.
    -책읽고 영화 보는 것 좋아하는 편이다.
    -법이나 질서 잘 지키려는 만큼 유통성이 조금 없는 편이다.
    -MBTI 유형 중 ESFP와 함께 외향성이 가장 강한 편이다.`,
    ENFJ: `민감하게 대처해야 하는 상황에 대응을 잘한다.
    다른 사람의 진가를 발견하고 있는 그대로를 인정할 줄 안다.
    -전형적인 인싸 + 혼자 시간도 잘 보내는 편이다.
    계획 짜는 것을 좋아한다.
    -일을 할 때 다른 사람과 의사소통을 잘한다.
    -스스로를 잘 아는 편이다.
    센스가 있으며 눈치가 빠른 편이다.
    전세계 인구의 약 2.5%이면서 국내에서는 1% 정도로 가장 희귀한 유형이다.`,
    ENTJ: `-문제 상황에 부딪히면 모든 방법을 활용하여 해결할 수 있는 방법을 찾으려고 한다.
    -조직적/체계적/계획적이다.
    -관심 분야와 관련된 새로운 지식에 관심이 많다.
    -복잡한 문제나 지적인 자극을 주는 새로운 아이디어에 호기심이 많다.
    -반복되는 일상보단 변화 있는 생활 선호한다.
    -실용성/효율성을 중시한다.
    -자신만의 기준이 있고 그 기준에 미치지 못하는 사람은 못마땅해한다.
    -해보지도 않고 못한다는 말을 싫어한다.
    -직설적인 화법으로 갈등을 야기하기도 한다.
    -새로운 사람 만나는 것은 좋지만 깊은 관계까지는 좋아하지 않는 편이다.
    -감성 보다는 논리적인 사실 중시한다.
    -독재자가 되지 않도록 유의해야 한다.`
};
