export const typeDescriptions = {
    ISTJ: '근면하고 성실한 사람으로, 현실적이고 조직적인 성향으로, 집중력이 강하고 책임감이 높습니다.',
    ISFJ: '용감하고 배려심 많은 사람으로, 현실적이면서도 다른 사람을 배려하는 성향으로 조용하고 신중한 편입니다.',
    INFJ: '열정적이고 선의의 사람으로, 인간관계에 민감하고 상상력이 풍부하며, 자기 주장을 가질 수 있는 유형입니다.',
    INTJ: '독립적이고 논리적인 사람으로, 분석적이고 논리적인 성향으로 비전을 가지고 목표를 추구하는 경향이 있습니다.',
    ISTP: '냉철하고 탐구적인 사람으로, 문제 해결 능력이 뛰어나고 실제적인 능력을 가지며 독립심이 강합니다.',
    ISFP: '예술적이고 감정 기반의 사람으로, 예술적이며 공감능력이 뛰어나며, 조용하고 적응력이 좋습니다.',
    INFP: '열정적이고 이상주의적인 사람으로, 상상력이 풍부하고 내적 가치를 중요시하는 성향으로 타인을 이해하고 돕는 데 관심이 있습니다.',
    INTP: '논리적이고 분석적인 사람으로, 분석적이며 창의적인 성향으로 지적 호기심이 강하고 독립적입니다.',
    ESTP: '활동적이고 실용적인 사람으로, 적응력이 뛰어나며 활동적인 성향으로 문제를 해결하는 데 능숙합니다.',
    ESFP: '재미있고 활기찬 사람으로, 사교적이며 재치가 있으며, 주변 사람들과 함께하는 것을 즐깁니다.',
    ENFP: '열정적이고 사교적인 사람으로, 사교적이며 상상력이 풍부하며, 새로운 아이디어와 경험을 즐깁니다.',
    ENTP: '재치있고 논쟁적인 사람으로, 독창적이며 적극적으로 새로운 아이디어를 찾아내며, 논쟁을 좋아합니다.',
    ESTJ: '활동적이고 현실적인 사람으로, 실제적이며 조직적인 성향으로, 책임감이 높고 현실적인 문제 해결에 능숙합니다.',
    ESFJ: '친절하고 협조적인 사람으로, 다른 사람들을 배려하고 돕는 데 열정적이며, 사교성이 높습니다.',
    ENFJ: '열정적이고 사회적인 사람으로, 사회적이며 다른 사람들을 이끌어나가는 역할을 잘 하는 유형입니다.',
    ENTJ: '지도력 있는 사람으로, 지도력과 리더십을 가지며 목표 달성을 위해 계획적으로 움직입니다.'
};
